import { Key } from 'ts/types';

export const russian = {
    // Landing Page
    [Key.TopHeader]: 'Стимулирование децентрализованного обмена',
    [Key.TopTagline]:
        '0x — это протокол с открытым кодом, позволяющий торговать токенами ERC20, выпущенными на блокчейне Ethereum.',
    [Key.BuildCallToAction]: 'Разработано на 0x',
    [Key.CommunityCallToAction]: 'Чат',
    [Key.ProjectsHeader]: 'ПРОЕКТЫ, РАЗРАБОТАННЫЕ НА 0X',
    [Key.FullListPrompt]: 'Просмотреть',
    [Key.FullListLink]: 'полный список',
    [Key.TokenizedSectionHeader]: 'Сегодняшний мир движется к токенизации ценности',
    [Key.TokenizedSectionDescription]:
        'Блокчейн Ethereum — это открытая, безграничная финансовая система, большое количество активов которой представлено в виде криптографических токенов. В будущем большая часть цифровых активов и товаров будет токенизирована.',
    [Key.Currency]: 'Валюта',
    [Key.TraditionalAssets]: 'Традиционные активы',
    [Key.DigitalGoods]: 'Цифровые товары',
    [Key.OffChainOrderRelay]: 'Офчейн-транзакция',
    [Key.OonChainSettlement]: 'Ончейн-транзакция',
    [Key.OffChainOnChainDescription]:
        'При использовании протокола 0x ордера проводятся вне блокчейна, что сокращает расходы на газ (топливо) и предотвращает раздувание блокчейна. Релейеры помогают провести ордера и берут комиссию каждый раз, когда способствуют торгам. Любой может создать релейера.',
    [Key.RelayersHeader]: 'РЕЛЕЙЕРЫ, РАЗРАБОТАННЫЕ НА 0X',
    [Key.BenefitsHeader]: 'Просмотреть все',
    [Key.BenefitOneTitle]: 'Обмен, не требующий доверия',
    [Key.BenefitOneDescription]:
        'Каждая сделка, основанная на распределенной сети Ethereum без единой точки отказа и с нулевым временем простоя, является атомарной операцией и проводится без риска для контрагента.',
    [Key.BenefitTwoTitle]: 'Общая ликвидность',
    [Key.BenefitTwoDescription]:
        'При обмене стандартным API релейеры могут легко объединять пулы ликвидности, создавая сетевые эффекты вокруг ликвидности, которые усложняются с появлением новых релейеров в сети.',
    [Key.BenefitThreeTitle]: 'Открытый исходный код',
    [Key.BenefitThreeDescription]:
        '0x — это бесплатный и доступный протокол с открытым кодом. Торгуйте напрямую с известными контрагентами бесплатно или заплатите релейеру несколько ZRX-токенов, чтобы получить доступ к его пулу ликвидности.',
    [Key.BuildingBlockSectionHeader]: 'Строительный блок для dApp',
    [Key.BuildingBlockSectionDescription]:
        'Протокол 0x — это подключаемый строительный блок для dApp, требующий обмена функциональностью. Присоединяйтесь к разработчикам, которые уже используют 0x в своих веб-приложениях и смарт-контрактах.',
    [Key.DevToolsPrompt]: 'Узнайте как это сделать,',
    [Key.SmartContract]: 'смарт-контрактам',
    [Key.Docs]: 'документацией',
    [Key.And]: 'и',
    [Key.DecentralizedGovernance]: 'ДЕЦЕНТРАЛИЗОВАННОЕ УПРАВЛЕНИЕ',
    [Key.DecentralizedGovernanceDescription]:
        'Децентрализованные организации используют токены для представления собственности и внедрения своей логики управления. Протокол 0x позволяет децентрализованным организациям беспрепятственно и безопасно торговать собственностью для стартового капитала.',
    [Key.PredictionMarkets]: 'РЫНКИ ПРОГНОЗОВ',
    [Key.PredictionMarketsDescription]:
        'Платформы для децентрализованных рынков прогнозов генерируют множество токенов, которые представляют собой финансовую долю в результате реальных событий. Протокол 0x позволяет мгновенно продавать эти токены.',
    [Key.StableTokens]: 'СТАБИЛЬНЫЕ ТОКЕНЫ',
    [Key.StableTokensDescription]:
        'Новые экономические конструкции, например стабильные монеты, требуют наличия успешных и эффективных ликвидных рынков. Протокол 0x призван облегчить основные экономические механизмы, которые позволят этим токенам оставаться стабильными.',
    [Key.DecentralizedLoans]: 'ДЕЦЕНТРАЛИЗОВАННЫЕ ЗАЙМЫ',
    [Key.DecentralizedLoansDescription]:
        'Эффективное кредитование требует наличия ликвидных рынков, где инвесторы могут купить и перепродать займы. Протокол 0x позволяет экосистеме кредиторов самоорганизовываться и эффективно определять рыночные цены для всех невыплаченных займов.',
    [Key.FundManagement]: 'УПРАВЛЕНИЕ СРЕДСТВАМИ',
    [Key.FundManagementDescription]:
        'Децентрализованное управление средствами ограничивает управляющих средствами путем определения предварительно согласованных классов активов для инвестиций. Встраивание протокола 0x в смарт-контракты для управления средствами позволяет им обеспечить исполнение этих ограничений безопасности.',
    [Key.FinalCallToAction]: 'Начните создавать децентрализованное будущее',
    // Footer
    [Key.Documentation]: 'Документация',
    [Key.Community]: 'Сообщество',
    [Key.Organization]: 'Организация',
    [Key.About]: 'Kоманда',
    [Key.Careers]: 'Карьера',
    [Key.Contact]: 'Связаться с нами',
    [Key.Blog]: 'Блог',
    [Key.Forum]: 'Форум',
    [Key.Connect]: '0x Connect',
    [Key.Whitepaper]: 'Белая книга',
    [Key.Wiki]: 'Вики',
    [Key.Faq]: 'Документация',
    [Key.SmartContracts]: '0x Смарт-контракты ',
    [Key.StandardRelayerApi]: 'standard relayer API',
    [Key.PortalDApp]: 'DApp-портал',
    [Key.Website]: 'Веб-сайт',
    [Key.Home]: 'Домашняя страница',
    [Key.RocketChat]: 'Rocket.chat',
    // TopBar
    [Key.Developers]: 'Разработчики',
};
